{
  "science": {
    "biology": {
      "formal": "Biology is the study of living organisms, including their structure, function, growth, evolution, and interactions.",
      "casual": "Biology is basically the science of life — how stuff grows, evolves, and stays alive.",
      "chatbot_questions": [
        "Do you like learning about living things?",
        "What’s your favorite part of biology — animals, cells, or nature?",
        "Have you ever looked at something under a microscope?"
      ],
      "chatbot_responses": [
        "I love learning about life — everything from tiny cells to giant whales!",
        "Animals are fascinating, but cells hold the secrets of life.",
        "Microscopes open up a whole new world, don’t they?"
      ]
    },
    "physics": {
      "formal": "Physics explores the laws of nature that govern energy, matter, space, and time.",
      "casual": "Physics is the rulebook of the universe — it tells stuff how to move, spin, or fall.",
      "chatbot_questions": [
        "Ever wonder why things fall or how gravity works?",
        "Do you enjoy physics experiments?",
        "What’s cooler to you — black holes or quantum stuff?"
      ],
      "chatbot_responses": [
        "Gravity keeps us grounded — literally!",
        "Physics experiments are like magic tricks, but real.",
        "Black holes are mysterious, but quantum stuff blows my mind!"
      ]
    },
    "chemistry": {
      "formal": "Chemistry studies substances, their properties, how they interact, and how they're transformed.",
      "casual": "Chemistry is all about mixing stuff, blowing stuff up (safely), and figuring out what everything's made of.",
      "chatbot_questions": [
        "Do you like doing chemistry experiments?",
        "Have you ever made a volcano in school?",
        "What's your favorite element on the periodic table?"
      ],
      "chatbot_responses": [
        "Mixing chemicals safely can be so exciting!",
        "Volcano projects are classic — did you make one erupt?",
        "I think oxygen is pretty important, but I also like gold!"
      ]
    },
    "astronomy": {
      "formal": "Astronomy is the scientific study of celestial objects like stars, planets, and galaxies, and the universe as a whole.",
      "casual": "Astronomy is all about the stars, planets, and all the cool stuff floating in space.",
      "chatbot_questions": [
        "Do you ever look up at the stars at night?",
        "What's your favorite planet or constellation?",
        "Have you heard about the latest discoveries in space?"
      ]
    }
  },
  "human_and_society": {
    "psychology": {
      "formal": "Psychology is the scientific study of the mind and behavior, covering areas like cognition, emotion, and development.",
      "casual": "Psychology helps us understand why people think, feel, and do the weird stuff they do.",
      "chatbot_questions": [
        "Have you ever studied psychology before?",
        "What do you think influences human behavior the most?",
        "Do you believe people can really change?"
      ]
    }
  }
}
